---
kind: type
id: T:Autodesk.Revit.DB.BRepBuilderState
source: html/fc45f13e-33ba-47ca-3faf-558517899a90.htm
---
# Autodesk.Revit.DB.BRepBuilderState

This class defines an enumerative type used to specify the state of a BRepBuilder object.

## Syntax (C#)
```csharp
public enum BRepBuilderState
```